rocm10_check/logs/kimi_tp4/run.log
[04:58:58] === Kimi TP4 on ROCm10, target: aiter FP8 ASM MLA prefill ===
[04:58:58] waiting for server (up to 40 min: weight load + aiter JIT)
[05:03:20] server READY after 265s
[05:03:20] === prefill path check ===
[05:03:20]   no flash_attn_varlen fallback error so far
[05:03:20] === benchmark: 8192x1024 conc=128 prompts=384 ===
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x712c8d9483b0>, trust_remote_code=True, seed=0, num_prompts=384, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=8192, random_output_len=1024, random_range_ratio='0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='vllm', base_url=None, host='127.0.0.1', port=19000, endpoint='/v1/completions', header=None, max_concurrency=128, model='/dev/shm/model/Kimi-K2.5-MXFP4', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, probe_request_rate=0.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/workspace', result_filename='bench.json', ignore_eos=True, self_timed=None, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-08e3c0f2-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
WARNING 08-14 09:03:25 [registry.py:259] Using a slow tokenizer. This might cause a significant slowdown. Consider using a fast tokenizer instead.
INFO 08-14 09:03:25 [utils.py:90] Sampling input_len from [8192, 8192] and output_len from [1024, 1024]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 128
100%|██████████| 384/384 [04:04<00:00,  1.57it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     384       
Failed requests:                         0         
Maximum request concurrency:             128       
Benchmark duration (s):                  244.58    
Total input tokens:                      3145728   
Total generated tokens:                  393216    
Request throughput (req/s):              1.57      
Output token throughput (tok/s):         1607.71   
Peak output token throughput (tok/s):    2944.00   
Peak concurrent requests:                133.00    
Total token throughput (tok/s):          14469.40  
---------------Time to First Token----------------
Mean TTFT (ms):                          7517.65   
Median TTFT (ms):                        1185.62   
P99 TTFT (ms):                           39310.83  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          71.74     
Median TPOT (ms):                        75.04     
P99 TPOT (ms):                           81.21     
---------------Inter-token Latency----------------
Mean ITL (ms):                           71.74     
Median ITL (ms):                         48.09     
P99 ITL (ms):                            327.94    
==================================================
[05:07:38] === result ===
  total_token_throughput = 14469.40 tok/s over TP4
  tok/s/GPU              = 3617.35
  output_throughput      = 1607.71
  completed              = 384
  mean TTFT / TPOT       = 7517.6 ms / 71.74 ms
  (TP8 ROCm7 baseline 2239.96 tok/s/GPU -- NOT like-for-like: different TP,
   aiter sampler disabled; treat as a does-it-run signal, not a perf number)
[05:07:38] === final prefill path verdict ===
[05:07:39] === DONE ===